Paciente8159/uCNC/uCNC/src/hal/mcus/samd21/mcumap_samd21.h
#define __pinmuxevenodd0 PMUXE
#define __pinmuxevenodd2 PMUXE
#define __pinmuxevenodd4 PMUXE
#define __pinmuxevenodd6 PMUXE
#define __pinmuxevenodd8 PMUXE
#define __pinmuxevenodd10 PMUXE
#define __pinmuxevenodd12 PMUXE
#define __pinmuxevenodd14 PMUXE
#define __pinmuxevenodd16 PMUXE
#define __pinmuxevenodd18 PMUXE
#define __pinmuxevenodd20 PMUXE
#define __pinmuxevenodd22 PMUXE
#define __pinmuxevenodd24 PMUXE
#define __pinmuxevenodd26 PMUXE
#define __pinmuxevenodd28 PMUXE
#define __pinmuxevenodd30 PMUXE
#define __pinmuxevenodd1 PMUXO
#define __pinmuxevenodd3 PMUXO
#define __pinmuxevenodd5 PMUXO
#define __pinmuxevenodd7 PMUXO
#define __pinmuxevenodd9 PMUXO
#define __pinmuxevenodd11 PMUXO
#define __pinmuxevenodd13 PMUXO
#define __pinmuxevenodd15 PMUXO
#define __pinmuxevenodd17 PMUXO
#define __pinmuxevenodd19 PMUXO
#define __pinmuxevenodd21 PMUXO
#define __pinmuxevenodd23 PMUXO
#define __pinmuxevenodd25 PMUXO
#define __pinmuxevenodd27 PMUXO
#define __pinmuxevenodd29 PMUXO
#define __pinmuxevenodd31 PMUXO
#define pinmuxevenodd(X) __pinmuxevenodd##X
#define __pinmux__(X, Y, Z) (X.PMUX[Y >> 1].bit.Z)
#define pinmux(X, Y) (__pinmux__(PORTREG(X), (Y), pinmuxevenodd(Y)))

#define pinmuxval_A (0x0U)
#define pinmuxval_B (0x1U)
#define pinmuxval_C (0x2U)
#define pinmuxval_D (0x3U)
#define pinmuxval_E (0x4U)
#define pinmuxval_F (0x5U)
#define pinmuxval_G (0x6U)
#define pinmuxval_H (0x7U)
#define _pinmuxval(X) (pinmuxval_##X)
#define pinmuxval(X) (_pinmuxval(X))

// #define sercompad_RX_0 (0x0U)
// #define sercompad_RX_1 (0x1U)
// #define sercompad_RX_2 (0x2U)
// #define sercompad_RX_3 (0x3U)
// #define sercompad_TX_0 (0x2U)
// #define sercompad_TX_2 (0x1U)
// #define _sercompad(X, Y) (sercompad##X##_##Y)
// #define sercompad(X, Y) (_sercompad(X, Y))

#define SERCOMPADRX_0_A8 0
#define SERCOMPADRX_0_A9 1
#define SERCOMPADRX_0_A10 2
#define SERCOMPADRX_0_A11 3
#define SERCOMPADRX_1_A16 0
#define SERCOMPADRX_1_A17 1
#define SERCOMPADRX_1_A18 2
#define SERCOMPADRX_1_A19 3
#define SERCOMPADRX_2_A12 0
#define SERCOMPADRX_2_A13 1
#define SERCOMPADRX_2_A14 2
#define SERCOMPADRX_2_A15 3
#define SERCOMPADRX_3_A22 0
#define SERCOMPADRX_3_A23 1
#define SERCOMPADRX_3_A24 2
#define SERCOMPADRX_3_A25 3
#define SERCOMPADRX_5_A20 2
#define SERCOMPADRX_5_A21 3

#define SERCOMPADTX_0_A8 0
#define SERCOMPADTX_0_A10 2
#define SERCOMPADTX_1_A16 0
#define SERCOMPADTX_1_A18 2
#define SERCOMPADTX_2_A12 0
#define SERCOMPADTX_2_A14 2
#define SERCOMPADTX_3_A22 0
#define SERCOMPADTX_3_A24 2
#define SERCOMPADTX_5_A20 2

// SERCOMPAD_ALT
#define SERCOMPADRX_0_A4 0x0U
#define SERCOMPADRX_0_A5 0x1U
#define SERCOMPADRX_0_A6 0x2U
#define SERCOMPADRX_0_A7 0x3U
#define SERCOMPADRX_1_A0 0x0U
#define SERCOMPADRX_1_A1 0x1U
#define SERCOMPADRX_1_B30 0x2U
#define SERCOMPADRX_1_A31 0x3U
#define SERCOMPADRX_2_A8 0x0U
#define SERCOMPADRX_2_A9 0x1U
#define SERCOMPADRX_2_A10 0x2U
#define SERCOMPADRX_2_A11 0x3U
#define SERCOMPADRX_3_A16 0x0U
#define SERCOMPADRX_3_A17 0x1U
#define SERCOMPADRX_3_A18 0x2U
#define SERCOMPADRX_3_A19 0x3U
#define SERCOMPADRX_3_A20 0x2U
#define SERCOMPADRX_3_A21 0x3U
#define SERCOMPADRX_4_B8 0x0U
#define SERCOMPADRX_4_B9 0x1U
#define SERCOMPADRX_4_A10 0x2U
#define SERCOMPADRX_4_A11 0x3U
#define SERCOMPADRX_4_A12 0x0U
#define SERCOMPADRX_4_A13 0x1U
#define SERCOMPADRX_4_A14 0x2U
#define SERCOMPADRX_4_A15 0x3U
#define SERCOMPADRX_5_A22 0x0U
#define SERCOMPADRX_5_A23 0x1U
#define SERCOMPADRX_5_A24 0x2U
#define SERCOMPADRX_5_A25 0x3U
#define SERCOMPADRX_5_B2 0x0U
#define SERCOMPADRX_5_B3 0x1U
#define SERCOMPADRX_5_B22 0x2U
#define SERCOMPADRX_5_B23 0x3U

#define SERCOMPADTX_0_A4 0x2U
#define SERCOMPADTX_0_A6 0x1U
#define SERCOMPADTX_1_A0 0x2U
#define SERCOMPADTX_1_B30 0x1U
#define SERCOMPADTX_2_A8 0x2U
#define SERCOMPADTX_2_A10 0x1U
#define SERCOMPADTX_3_A16 0x2U
#define SERCOMPADTX_3_A18 0x1U
#define SERCOMPADTX_3_A20 0x1U
#define SERCOMPADTX_4_B8 0x2U
#define SERCOMPADTX_4_A10 0x1U
#define SERCOMPADTX_4_A12 0x2U
#define SERCOMPADTX_4_A14 0x1U
#define SERCOMPADTX_5_A22 0x2U
#define SERCOMPADTX_5_A24 0x1U
#define SERCOMPADTX_5_B2 0x2U
#define SERCOMPADTX_5_B22 0x1U

#define _sercompad(W, X, Y, Z) (SERCOMPAD##W##X##_##Y##Z)
#define sercompad(W, X, Y, Z) (_sercompad(W, X, Y, Z))

#define SERCOMMUX_0_A8 0x2U
#define SERCOMMUX_0_A9 0x2U
#define SERCOMMUX_0_A10 0x2U
#define SERCOMMUX_0_A11 0x2U
#define SERCOMMUX_1_A16 0x2U
#define SERCOMMUX_1_A17 0x2U
#define SERCOMMUX_1_A18 0x2U
#define SERCOMMUX_1_A19 0x2U
#define SERCOMMUX_2_A12 0x2U
#define SERCOMMUX_2_A13 0x2U
#define SERCOMMUX_2_A14 0x2U
#define SERCOMMUX_2_A15 0x2U
#define SERCOMMUX_3_A22 0x2U
#define SERCOMMUX_3_A23 0x2U
#define SERCOMMUX_3_A24 0x2U
#define SERCOMMUX_3_A25 0x2U
#define SERCOMMUX_5_A20 0x2U
#define SERCOMMUX_5_A21 0x2U
// SERCOMMUX_ALT
#define SERCOMMUX_0_A4 0x3U
#define SERCOMMUX_0_A5 0x3U
#define SERCOMMUX_0_A6 0x3U
#define SERCOMMUX_0_A7 0x3U
#define SERCOMMUX_1_A0 0x3U
#define SERCOMMUX_1_A1 0x3U
#define SERCOMMUX_1_B30 0x3U
#define SERCOMMUX_1_A31 0x3U
#define SERCOMMUX_2_A8 0x3U
#define SERCOMMUX_2_A9 0x3U
#define SERCOMMUX_2_A10 0x3U
#define SERCOMMUX_2_A11 0x3U
#define SERCOMMUX_3_A16 0x3U
#define SERCOMMUX_3_A17 0x3U
#define SERCOMMUX_3_A18 0x3U
#define SERCOMMUX_3_A19 0x3U
#define SERCOMMUX_3_A20 0x3U
#define SERCOMMUX_3_A21 0x3U
#define SERCOMMUX_4_B8 0x3U
#define SERCOMMUX_4_B9 0x3U
#define SERCOMMUX_4_A10 0x3U
#define SERCOMMUX_4_A11 0x3U
#define SERCOMMUX_4_A12 0x3U
#define SERCOMMUX_4_A13 0x3U
#define SERCOMMUX_4_A14 0x3U
#define SERCOMMUX_4_A15 0x3U
#define SERCOMMUX_5_A22 0x3U
#define SERCOMMUX_5_A23 0x3U
#define SERCOMMUX_5_A24 0x3U
#define SERCOMMUX_5_A25 0x3U
#define SERCOMMUX_5_B2 0x3U
#define SERCOMMUX_5_B3 0x3U
#define SERCOMMUX_5_B22 0x3U
#define SERCOMMUX_5_B23 0x3U
#define _sercommux_pin(X, Y, Z) (SERCOMMUX_##X##_##Y##Z)
#define sercommux_pin(X, Y, Z) (_sercommux_pin(X, Y, Z))

#ifdef MCU_HAS_USB
#define USB_DM_PMUX (pinmux(USB_DM_PORT, USB_DM_BIT))
#define USB_DM_PMUXVAL (pinmuxval(USB_DM_MUX))
#define DIO202_PMUX USB_DM_PMUX
#define DIO202_PMUXVAL USB_DM_PMUXVAL
#define USB_DP_PMUX (pinmux(USB_DP_PORT, USB_DP_BIT))
#define USB_DP_PMUXVAL (pinmuxval(USB_DP_MUX))
#define DIO203_PMUX USB_DP_PMUX
#define DIO203_PMUXVAL USB_DP_PMUXVAL
#ifdef USBCON
#undef USBCON
#endif
#endif

#ifdef MCU_HAS_UART
// Arduino already uses SERCOM0 and SERCOM 1
#ifndef BAUDRATE2
#define BAUDRATE2 BAUDRATE
#endif
#ifndef UART_PORT
#define UART_PORT 2
#endif
#define TX_PMUX (pinmux(TX_PORT, TX_BIT))
#define TX_PMUXVAL (sercommux_pin(UART_PORT, TX_PORT, TX_BIT))
#define DIO200_PMUX TX_PMUX
#define DIO200_PMUXVAL TX_PMUXVAL
#define RX_PMUX (pinmux(RX_PORT, RX_BIT))
#define RX_PMUXVAL (sercommux_pin(UART_PORT, RX_PORT, RX_BIT))
#define DIO201_PMUX RX_PMUX
#define DIO201_PMUXVAL RX_PMUXVAL
#define COM_UART __helper__(SERCOM, UART_PORT, )
#define PM_APBCMASK_COM __helper__(PM_APBCMASK_SERCOM, UART_PORT, )
#define GCLK_CLKCTRL_ID_COM __helper__(GCLK_CLKCTRL_ID_SERCOM, UART_PORT, _CORE)
#define COM_IRQ __helper__(SERCOM, UART_PORT, _IRQn)
#define mcu_com_isr __helper__(SERCOM, UART_PORT, _Handler)
#define COM_OUTREG (COM_UART->USART.DATA.reg)
#define COM_INREG (COM_UART->USART.DATA.reg)
#define COM_TX_PAD sercompad(TX_, UART_PORT, TX_PORT, TX_BIT)
#define COM_RX_PAD sercompad(RX_, UART_PORT, RX_PORT, RX_BIT)
#endif

#ifdef MCU_HAS_UART2
#ifndef BAUDRATE2
#define BAUDRATE2 BAUDRATE
#endif
// Arduino already uses SERCOM0 and SERCOM 1
#ifndef UART2_PORT
#define UART2_PORT 2
#endif
#define TX2_PMUX (pinmux(TX2_PORT, TX2_BIT))
#define TX2_PMUXVAL (sercommux_pin(UART2_PORT, TX2_PORT, TX2_BIT))
#define DIO210_PMUX TX2_PMUX
#define DIO210_PMUXVAL TX2_PMUXVAL
#define RX2_PMUX (pinmux(RX2_PORT, RX2_BIT))
#define RX2_PMUXVAL (sercommux_pin(UART2_PORT, RX2_PORT, RX2_BIT))
#define DIO211_PMUX RX2_PMUX
#define DIO211_PMUXVAL RX2_PMUXVAL
#define COM2_UART __helper__(SERCOM, UART2_PORT, )
#define PM_APBCMASK_COM2 __helper__(PM_APBCMASK_SERCOM, UART2_PORT, )
#define GCLK_CLKCTRL_ID_COM2                                                   \
  __helper__(GCLK_CLKCTRL_ID_SERCOM, UART2_PORT, _CORE)
#define COM2_IRQ __helper__(SERCOM, UART2_PORT, _IRQn)
#define mcu_com2_isr __helper__(SERCOM, UART2_PORT, _Handler)
#define COM2_OUTREG (COM2_UART->USART.DATA.reg)
#define COM2_INREG (COM2_UART->USART.DATA.reg)
#define COM2_TX_PAD sercompad(TX_, UART2_PORT, TX2_PORT, TX2_BIT)
#define COM2_RX_PAD sercompad(RX_, UART2_PORT, RX2_PORT, RX2_BIT)
#endif

#if (defined(SPI_CLK) && defined(SPI_SDO) && defined(SPI_SDI))
#define MCU_HAS_SPI
#define MCU_HAS_DMA
#ifndef SPI_PORT
#define SPI_PORT 1
#endif
#ifndef SPI_MODE
#define SPI_MODE 0
#endif
#ifndef SPI_FREQ
#define SPI_FREQ 1000000UL
#endif

