Paciente8159/uCNC/uCNC/src/hal/mcus/samd21/mcumap_samd21.h
#define SPICOM __helper__(SERCOM, SPI_PORT, )
#define PM_APBCMASK_SPICOM __helper__(PM_APBCMASK_SERCOM, SPI_PORT, )
#define GCLK_CLKCTRL_ID_SPICOM                                                 \
  __helper__(GCLK_CLKCTRL_ID_SERCOM, SPI_PORT, _CORE)
#define SPI_DATA (SPICOM->SPI.DATA.reg)
#define SPI_OUTPAD 0
#define SPI_INPAD 3

#define SPI_CLK_PMUX (pinmux(SPI_CLK_PORT, SPI_CLK_BIT))
#define SPI_CLK_PMUXVAL (sercommux_pin(SPI_PORT, SPI_CLK_PORT, SPI_CLK_BIT))
#define SPI_SDO_PMUX (pinmux(SPI_SDO_PORT, SPI_SDO_BIT))
#define SPI_SDO_PMUXVAL (sercommux_pin(SPI_PORT, SPI_SDO_PORT, SPI_SDO_BIT))
#define SPI_SDI_PMUX (pinmux(SPI_SDI_PORT, SPI_SDI_BIT))
#define SPI_SDI_PMUXVAL (sercommux_pin(SPI_PORT, SPI_SDI_PORT, SPI_SDI_BIT))

#define DIO204_PMUX SPI_CLK_PMUX
#define DIO204_PMUXVAL SPI_CLK_PMUXVAL
#define DIO205_PMUX SPI_SDI_PMUX
#define DIO205_PMUXVAL SPI_SDI_PMUXVAL
#define DIO206_PMUX SPI_SDO_PMUX
#define DIO206_PMUXVAL SPI_SDO_PMUXVAL

#define SPI_DMA_TRIGSRC_RX ((SPI_PORT << 1) + 1)
#define SPI_DMA_TRIGSRC_TX ((SPI_PORT << 1) + 2)

#define SPI_IRQ __helper__(SERCOM, SPI_PORT, _IRQn)
#define SPI_ISR __helper__(SERCOM, SPI_PORT, _Handler)

#if (SPI_PORT != 1 && SPI_PORT != 3)
#error "SPI PORT is not valid (SERCOM 1 or 3 only)"
#endif
#endif

#if (defined(SPI2_CLK) && defined(SPI2_SDO) && defined(SPI2_SDI))
#define MCU_HAS_SPI2
#define MCU_HAS_DMA
#ifndef SPI2_PORT
#define SPI2_PORT 1
#endif
#ifndef SPI2_MODE
#define SPI2_MODE 0
#endif
#ifndef SPI2_FREQ
#define SPI2_FREQ 1000000UL
#endif

#define SPI2COM __helper__(SERCOM, SPI2_PORT, )
#define PM_APBCMASK_SPI2COM __helper__(PM_APBCMASK_SERCOM, SPI2_PORT, )
#define GCLK_CLKCTRL_ID_SPI2COM                                                \
  __helper__(GCLK_CLKCTRL_ID_SERCOM, SPI2_PORT, _CORE)
#define SPI2_DATA (SPI2COM->SPI.DATA.reg)
#define SPI2_OUTPAD 0
#define SPI2_INPAD 3

#define SPI2_CLK_PMUX (pinmux(SPI2_CLK_PORT, SPI2_CLK_BIT))
#define SPI2_CLK_PMUXVAL (sercommux_pin(SPI2_PORT, SPI2_CLK_PORT, SPI2_CLK_BIT))
#define SPI2_SDO_PMUX (pinmux(SPI2_SDO_PORT, SPI2_SDO_BIT))
#define SPI2_SDO_PMUXVAL (sercommux_pin(SPI2_PORT, SPI2_SDO_PORT, SPI2_SDO_BIT))
#define SPI2_SDI_PMUX (pinmux(SPI2_SDI_PORT, SPI2_SDI_BIT))
#define SPI2_SDI_PMUXVAL (sercommux_pin(SPI2_PORT, SPI2_SDI_PORT, SPI2_SDI_BIT))

#define DIO212_PMUX SPI2_CLK_PMUX
#define DIO212_PMUXVAL SPI2_CLK_PMUXVAL
#define DIO213_PMUX SPI2_SDI_PMUX
#define DIO213_PMUXVAL SPI2_SDI_PMUXVAL
#define DIO214_PMUX SPI2_SDO_PMUX
#define DIO214_PMUXVAL SPI2_SDO_PMUXVAL

#define SPI2_DMA_TRIGSRC_RX ((SPI2_PORT << 1) + 1)
#define SPI2_DMA_TRIGSRC_TX ((SPI2_PORT << 1) + 2)

#define SPI2_IRQ __helper__(SERCOM, SPI2_PORT, _IRQn)
#define SPI2_ISR __helper__(SERCOM, SPI2_PORT, _Handler)

#if (SPI2_PORT != 1 && SPI2_PORT != 3)
#error "SPI2 PORT is not valid (SERCOM 1 or 3 only)"
#endif
#endif

#if (defined(I2C_CLK) && defined(I2C_DATA))
#define MCU_HAS_I2C
#define MCU_SUPPORTS_I2C_SLAVE

#ifndef I2C_PORT
#define I2C_PORT 3
#endif
#ifndef I2C_FREQ
#define I2C_FREQ 400000UL
#endif
#ifndef I2C_ADDRESS
#define I2C_ADDRESS 0
#endif

#define I2CCOM __helper__(SERCOM, I2C_PORT, )
#define PM_APBCMASK_I2CCOM __helper__(PM_APBCMASK_SERCOM, I2C_PORT, )
#define GCLK_CLKCTRL_ID_I2CCOM                                                 \
  __helper__(GCLK_CLKCTRL_ID_SERCOM, I2C_PORT, _CORE)
#define I2C_IRQ __helper__(SERCOM, I2C_PORT, _IRQn)
#define I2C_ISR __helper__(SERCOM, I2C_PORT, _Handler)
// #define OUTPAD 0
// #define INPAD 3

#define I2C_CLK_PMUX (pinmux(I2C_CLK_PORT, I2C_CLK_BIT))
#define I2C_CLK_PMUXVAL (sercommux_pin(I2C_PORT, I2C_CLK_PORT, I2C_CLK_BIT))
#define I2C_DATA_PMUX (pinmux(I2C_DATA_PORT, I2C_DATA_BIT))
#define I2C_DATA_PMUXVAL (sercommux_pin(I2C_PORT, I2C_DATA_PORT, I2C_DATA_BIT))

#define DIO208_PMUX I2C_CLK_PMUX
#define DIO208_PMUXVAL I2C_CLK_PMUXVAL
#define DIO209_PMUX I2C_DATA_PMUX
#define DIO209_PMUXVAL I2C_DATA_PMUXVAL

// #if (I2C_PORT != 1 && I2C_PORT != 3)
// #error "SPI PORT is not valid (SERCOM 1 or 3 only)"
// #endif
#endif

#ifdef MCU_HAS_DMA
#define DMA_CHANNEL_COUNT 12
#endif

/*ISR inputs*/
#if (defined(LIMIT_X_ISR) && defined(LIMIT_X))
#define LIMIT_X_ISRBIT (LIMIT_X_BIT & 0x0F)
#define LIMIT_X_ISRMASK (1U << (LIMIT_X_BIT & 0x0F))
#define LIMIT_X_PMUXVAL 0
#define LIMIT_X_PMUX (pinmux(LIMIT_X_PORT, LIMIT_X_BIT))
#define DIO100_ISRBIT LIMIT_X_ISRBIT
#define DIO100_ISRMASK LIMIT_X_ISRMASK
#define DIO100_PMUXVAL 0
#define DIO100_PMUX LIMIT_X_PMUX
#else
#define LIMIT_X_ISRMASK 0
#define DIO100_ISRMASK 0
#endif
#if (defined(LIMIT_Y_ISR) && defined(LIMIT_Y))
#define LIMIT_Y_ISRBIT (LIMIT_Y_BIT & 0x0F)
#define LIMIT_Y_ISRMASK (1U << (LIMIT_Y_BIT & 0x0F))
#define LIMIT_Y_PMUXVAL 0
#define LIMIT_Y_PMUX (pinmux(LIMIT_Y_PORT, LIMIT_Y_BIT))
#define DIO101_ISRBIT LIMIT_Y_ISRBIT
#define DIO101_ISRMASK LIMIT_Y_ISRMASK
#define DIO101_PMUXVAL 0
#define DIO101_PMUX LIMIT_Y_PMUX
#else
#define LIMIT_Y_ISRMASK 0
#define DIO101_ISRMASK 0
#endif
#if (defined(LIMIT_Z_ISR) && defined(LIMIT_Z))
#define LIMIT_Z_ISRBIT (LIMIT_Z_BIT & 0x0F)
#define LIMIT_Z_ISRMASK (1U << (LIMIT_Z_BIT & 0x0F))
#define LIMIT_Z_PMUXVAL 0
#define LIMIT_Z_PMUX (pinmux(LIMIT_Z_PORT, LIMIT_Z_BIT))
#define DIO102_ISRBIT LIMIT_Z_ISRBIT
#define DIO102_ISRMASK LIMIT_Z_ISRMASK
#define DIO102_PMUXVAL 0
#define DIO102_PMUX LIMIT_Z_PMUX
#else
#define LIMIT_Z_ISRMASK 0
#define DIO102_ISRMASK 0
#endif
#if (defined(LIMIT_X2_ISR) && defined(LIMIT_X2))
#define LIMIT_X2_ISRBIT (LIMIT_X2_BIT & 0x0F)
#define LIMIT_X2_ISRMASK (1U << (LIMIT_X2_BIT & 0x0F))
#define LIMIT_X2_PMUXVAL 0
#define LIMIT_X2_PMUX (pinmux(LIMIT_X2_PORT, LIMIT_X2_BIT))
#define DIO103_ISRBIT LIMIT_X2_ISRBIT
#define DIO103_ISRMASK LIMIT_X2_ISRMASK
#define DIO103_PMUXVAL 0
#define DIO103_PMUX LIMIT_X2_PMUX
#else
#define LIMIT_X2_ISRMASK 0
#define DIO103_ISRMASK 0
#endif
#if (defined(LIMIT_Y2_ISR) && defined(LIMIT_Y2))
#define LIMIT_Y2_ISRBIT (LIMIT_Y2_BIT & 0x0F)
#define LIMIT_Y2_ISRMASK (1U << (LIMIT_Y2_BIT & 0x0F))
#define LIMIT_Y2_PMUXVAL 0
#define LIMIT_Y2_PMUX (pinmux(LIMIT_Y2_PORT, LIMIT_Y2_BIT))
#define DIO104_ISRBIT LIMIT_Y2_ISRBIT
#define DIO104_ISRMASK LIMIT_Y2_ISRMASK
#define DIO104_PMUXVAL 0
#define DIO104_PMUX LIMIT_Y2_PMUX
#else
#define LIMIT_Y2_ISRMASK 0
#define DIO104_ISRMASK 0
#endif
#if (defined(LIMIT_Z2_ISR) && defined(LIMIT_Z2))
#define LIMIT_Z2_ISRBIT (LIMIT_Z2_BIT & 0x0F)
#define LIMIT_Z2_ISRMASK (1U << (LIMIT_Z2_BIT & 0x0F))
#define LIMIT_Z2_PMUXVAL 0
#define LIMIT_Z2_PMUX (pinmux(LIMIT_Z2_PORT, LIMIT_Z2_BIT))
#define DIO105_ISRBIT LIMIT_Z2_ISRBIT
#define DIO105_ISRMASK LIMIT_Z2_ISRMASK
#define DIO105_PMUXVAL 0
#define DIO105_PMUX LIMIT_Z2_PMUX
#else
#define LIMIT_Z2_ISRMASK 0
#define DIO105_ISRMASK 0
#endif
#if (defined(LIMIT_A_ISR) && defined(LIMIT_A))
#define LIMIT_A_ISRBIT (LIMIT_A_BIT & 0x0F)
#define LIMIT_A_ISRMASK (1U << (LIMIT_A_BIT & 0x0F))
#define LIMIT_A_PMUXVAL 0
#define LIMIT_A_PMUX (pinmux(LIMIT_A_PORT, LIMIT_A_BIT))
#define DIO106_ISRBIT LIMIT_A_ISRBIT
#define DIO106_ISRMASK LIMIT_A_ISRMASK
#define DIO106_PMUXVAL 0
#define DIO106_PMUX LIMIT_A_PMUX
#else
#define LIMIT_A_ISRMASK 0
#define DIO106_ISRMASK 0
#endif
#if (defined(LIMIT_B_ISR) && defined(LIMIT_B))
#define LIMIT_B_ISRBIT (LIMIT_B_BIT & 0x0F)
#define LIMIT_B_ISRMASK (1U << (LIMIT_B_BIT & 0x0F))
#define LIMIT_B_PMUXVAL 0
#define LIMIT_B_PMUX (pinmux(LIMIT_B_PORT, LIMIT_B_BIT))
#define DIO107_ISRBIT LIMIT_B_ISRBIT
#define DIO107_ISRMASK LIMIT_B_ISRMASK
#define DIO107_PMUXVAL 0
#define DIO107_PMUX LIMIT_B_PMUX
#else
#define LIMIT_B_ISRMASK 0
#define DIO107_ISRMASK 0
#endif
#if (defined(LIMIT_C_ISR) && defined(LIMIT_C))
#define LIMIT_C_ISRBIT (LIMIT_C_BIT & 0x0F)
#define LIMIT_C_ISRMASK (1U << (LIMIT_C_BIT & 0x0F))
#define LIMIT_C_PMUXVAL 0
#define LIMIT_C_PMUX (pinmux(LIMIT_C_PORT, LIMIT_C_BIT))
#define DIO108_ISRBIT LIMIT_C_ISRBIT
#define DIO108_ISRMASK LIMIT_C_ISRMASK
#define DIO108_PMUXVAL 0
#define DIO108_PMUX LIMIT_C_PMUX
#else
#define LIMIT_C_ISRMASK 0
#define DIO108_ISRMASK 0
#endif
#if (defined(PROBE_ISR) && defined(PROBE))
#define PROBE_ISRBIT (PROBE_BIT & 0x0F)
#define PROBE_ISRMASK (1U << (PROBE_BIT & 0x0F))
#define PROBE_PMUXVAL 0
#define PROBE_PMUX (pinmux(PROBE_PORT, PROBE_BIT))
#define DIO109_ISRBIT PROBE_ISRBIT
#define DIO109_ISRMASK PROBE_ISRMASK
#define DIO109_PMUXVAL 0
#define DIO109_PMUX PROBE_PMUX
#else
#define PROBE_ISRMASK 0
#define DIO109_ISRMASK 0
#endif
#if (defined(ESTOP_ISR) && defined(ESTOP))
#define ESTOP_ISRBIT (ESTOP_BIT & 0x0F)
#define ESTOP_ISRMASK (1U << (ESTOP_BIT & 0x0F))
#define ESTOP_PMUXVAL 0
#define ESTOP_PMUX (pinmux(ESTOP_PORT, ESTOP_BIT))
#define DIO110_ISRBIT ESTOP_ISRBIT
#define DIO110_ISRMASK ESTOP_ISRMASK
#define DIO110_PMUXVAL 0
#define DIO110_PMUX ESTOP_PMUX
#else
#define ESTOP_ISRMASK 0
#define DIO110_ISRMASK 0
#endif
#if (defined(SAFETY_DOOR_ISR) && defined(SAFETY_DOOR))
#define SAFETY_DOOR_ISRBIT (SAFETY_DOOR_BIT & 0x0F)
#define SAFETY_DOOR_ISRMASK (1U << (SAFETY_DOOR_BIT & 0x0F))
#define SAFETY_DOOR_PMUXVAL 0
#define SAFETY_DOOR_PMUX (pinmux(SAFETY_DOOR_PORT, SAFETY_DOOR_BIT))
#define DIO111_ISRBIT SAFETY_DOOR_ISRBIT
#define DIO111_ISRMASK SAFETY_DOOR_ISRMASK
#define DIO111_PMUXVAL 0
#define DIO111_PMUX SAFETY_DOOR_PMUX
#else
#define SAFETY_DOOR_ISRMASK 0
#define DIO111_ISRMASK 0
#endif
#if (defined(FHOLD_ISR) && defined(FHOLD))
#define FHOLD_ISRBIT (FHOLD_BIT & 0x0F)
#define FHOLD_ISRMASK (1U << (FHOLD_BIT & 0x0F))
#define FHOLD_PMUXVAL 0
#define FHOLD_PMUX (pinmux(FHOLD_PORT, FHOLD_BIT))
#define DIO112_ISRBIT FHOLD_ISRBIT
#define DIO112_ISRMASK FHOLD_ISRMASK
#define DIO112_PMUXVAL 0
#define DIO112_PMUX FHOLD_PMUX
#else
#define FHOLD_ISRMASK 0
#define DIO112_ISRMASK 0
#endif
#if (defined(CS_RES_ISR) && defined(CS_RES))
#define CS_RES_ISRBIT (CS_RES_BIT & 0x0F)
#define CS_RES_ISRMASK (1U << (CS_RES_BIT & 0x0F))
#define CS_RES_PMUXVAL 0
#define CS_RES_PMUX (pinmux(CS_RES_PORT, CS_RES_BIT))
#define DIO113_ISRBIT CS_RES_ISRBIT
#define DIO113_ISRMASK CS_RES_ISRMASK
#define DIO113_PMUXVAL 0
#define DIO113_PMUX CS_RES_PMUX
#else
#define CS_RES_ISRMASK 0
#define DIO113_ISRMASK 0
#endif
#if (defined(DIN0_ISR) && defined(DIN0))
#define DIN0_ISRBIT (DIN0_BIT & 0x0F)
#define DIN0_ISRMASK (1U << (DIN0_BIT & 0x0F))
#define DIN0_PMUXVAL 0
#define DIN0_PMUX (pinmux(DIN0_PORT, DIN0_BIT))
#define DIO130_ISRBIT DIN0_ISRBIT
#define DIO130_ISRMASK DIN0_ISRMASK
#define DIO130_PMUXVAL 0
#define DIO130_PMUX DIN0_PMUX
#else
#define DIN0_ISRMASK 0
#define DIO130_ISRMASK 0
#endif
#if (defined(DIN1_ISR) && defined(DIN1))
#define DIN1_ISRBIT (DIN1_BIT & 0x0F)
#define DIN1_ISRMASK (1U << (DIN1_BIT & 0x0F))
#define DIN1_PMUXVAL 0
#define DIN1_PMUX (pinmux(DIN1_PORT, DIN1_BIT))
#define DIO131_ISRBIT DIN1_ISRBIT
#define DIO131_ISRMASK DIN1_ISRMASK
#define DIO131_PMUXVAL 0
#define DIO131_PMUX DIN1_PMUX
#else
#define DIN1_ISRMASK 0
#define DIO131_ISRMASK 0
#endif
#if (defined(DIN2_ISR) && defined(DIN2))
#define DIN2_ISRBIT (DIN2_BIT & 0x0F)
#define DIN2_ISRMASK (1U << (DIN2_BIT & 0x0F))
#define DIN2_PMUXVAL 0
#define DIN2_PMUX (pinmux(DIN2_PORT, DIN2_BIT))
#define DIO132_ISRBIT DIN2_ISRBIT
#define DIO132_ISRMASK DIN2_ISRMASK
#define DIO132_PMUXVAL 0
#define DIO132_PMUX DIN2_PMUX
#else
#define DIN2_ISRMASK 0
#define DIO132_ISRMASK 0
#endif
#if (defined(DIN3_ISR) && defined(DIN3))
#define DIN3_ISRBIT (DIN3_BIT & 0x0F)
#define DIN3_ISRMASK (1U << (DIN3_BIT & 0x0F))
#define DIN3_PMUXVAL 0
#define DIN3_PMUX (pinmux(DIN3_PORT, DIN3_BIT))
#define DIO133_ISRBIT DIN3_ISRBIT
#define DIO133_ISRMASK DIN3_ISRMASK
#define DIO133_PMUXVAL 0
#define DIO133_PMUX DIN3_PMUX
#else
#define DIN3_ISRMASK 0
#define DIO133_ISRMASK 0
#endif
#if (defined(DIN4_ISR) && defined(DIN4))
#define DIN4_ISRBIT (DIN4_BIT & 0x0F)
#define DIN4_ISRMASK (1U << (DIN4_BIT & 0x0F))
#define DIN4_PMUXVAL 0
#define DIN4_PMUX (pinmux(DIN4_PORT, DIN4_BIT))
#define DIO134_ISRBIT DIN4_ISRBIT
#define DIO134_ISRMASK DIN4_ISRMASK
#define DIO134_PMUXVAL 0
#define DIO134_PMUX DIN4_PMUX
#else
#define DIN4_ISRMASK 0
#define DIO134_ISRMASK 0
#endif
#if (defined(DIN5_ISR) && defined(DIN5))
#define DIN5_ISRBIT (DIN5_BIT & 0x0F)
#define DIN5_ISRMASK (1U << (DIN5_BIT & 0x0F))
#define DIN5_PMUXVAL 0
#define DIN5_PMUX (pinmux(DIN5_PORT, DIN5_BIT))
#define DIO135_ISRBIT DIN5_ISRBIT
#define DIO135_ISRMASK DIN5_ISRMASK
#define DIO135_PMUXVAL 0
#define DIO135_PMUX DIN5_PMUX
#else
#define DIN5_ISRMASK 0
#define DIO135_ISRMASK 0
#endif
#if (defined(DIN6_ISR) && defined(DIN6))
#define DIN6_ISRBIT (DIN6_BIT & 0x0F)
#define DIN6_ISRMASK (1U << (DIN6_BIT & 0x0F))
#define DIN6_PMUXVAL 0
#define DIN6_PMUX (pinmux(DIN6_PORT, DIN6_BIT))
#define DIO136_ISRBIT DIN6_ISRBIT
#define DIO136_ISRMASK DIN6_ISRMASK
#define DIO136_PMUXVAL 0
#define DIO136_PMUX DIN6_PMUX
#else
#define DIN6_ISRMASK 0
#define DIO136_ISRMASK 0
#endif
#if (defined(DIN7_ISR) && defined(DIN7))
#define DIN7_ISRBIT (DIN7_BIT & 0x0F)
#define DIN7_ISRMASK (1U << (DIN7_BIT & 0x0F))
#define DIN7_PMUXVAL 0
#define DIN7_PMUX (pinmux(DIN7_PORT, DIN7_BIT))
#define DIO137_ISRBIT DIN7_ISRBIT
#define DIO137_ISRMASK DIN7_ISRMASK
#define DIO137_PMUXVAL 0
#define DIO137_PMUX DIN7_PMUX
#else
#define DIN7_ISRMASK 0
#define DIO137_ISRMASK 0
#endif

