Paciente8159/uCNC/uCNC/src/hal/mcus/samd21/mcumap_samd21.h
#define LIMITS_EICMASK                                                         \
  (LIMIT_X_ISRMASK | LIMIT_Y_ISRMASK | LIMIT_Z_ISRMASK | LIMIT_X2_ISRMASK |    \
   LIMIT_Y2_ISRMASK | LIMIT_Z2_ISRMASK | LIMIT_A_ISRMASK | LIMIT_B_ISRMASK |   \
   LIMIT_C_ISRMASK)
#define CONTROLS_EICMASK                                                       \
  (ESTOP_ISRMASK | SAFETY_DOOR_ISRMASK | FHOLD_ISRMASK | CS_RES_ISRMASK)
#define PROBE_EICMASK (PROBE_ISRMASK)
#define DIN_IO_EICMASK                                                         \
  (DIN0_ISRMASK | DIN1_ISRMASK | DIN2_ISRMASK | DIN3_ISRMASK | DIN4_ISRMASK |  \
   DIN5_ISRMASK | DIN6_ISRMASK | DIN7_ISRMASK)

#define SAMD21_EIC_MASK                                                        \
  (LIMITS_EICMASK | CONTROLS_EICMASK | PROBE_EICMASK | DIN_IO_EICMASK)

/*timers-unused*/
#define gclk_clkctrl(X) (0x1A + (X >> 1))

/*PWM*/
#define pwm_tcc_config(timer, channel, presc)                                  \
  do {                                                                         \
    timer->CTRLA.bit.ENABLE = 0;                                               \
    while (timer->SYNCBUSY.reg & TCC_SYNCBUSY_MASK)                            \
      ;                                                                        \
    timer->CTRLA.bit.PRESCALER = presc;                                        \
    while (timer->SYNCBUSY.reg & TCC_SYNCBUSY_MASK)                            \
      ;                                                                        \
    timer->WAVE.bit.WAVEGEN = 2;                                               \
    while (timer->SYNCBUSY.reg & TCC_SYNCBUSY_MASK)                            \
      ;                                                                        \
    timer->WEXCTRL.reg = 0;                                                    \
    while (timer->SYNCBUSY.reg & TCC_SYNCBUSY_MASK)                            \
      ;                                                                        \
    timer->CC[(channel & 0x3)].reg = 0;                                        \
    while (timer->SYNCBUSY.reg & TCC_SYNCBUSY_MASK)                            \
      ;                                                                        \
    timer->PER.bit.PER = 255;                                                  \
    while (timer->SYNCBUSY.reg & TCC_SYNCBUSY_MASK)                            \
      ;                                                                        \
    timer->CTRLA.bit.ENABLE = 1;                                               \
    while (timer->SYNCBUSY.reg & TCC_SYNCBUSY_MASK)                            \
      ;                                                                        \
  } while (0)

#define pwm_tcc_get(timer, channel) (timer->CC[(channel & 0x3)].reg)
#define pwm_tcc_set(timer, channel, value)                                     \
  do {                                                                         \
    timer->CTRLBSET.bit.LUPD = 1;                                              \
    while (timer->SYNCBUSY.reg & TCC_SYNCBUSY_MASK)                            \
      ;                                                                        \
    timer->CCB[(channel & 0x3)].reg = value;                                   \
    while (timer->SYNCBUSY.reg & TCC_SYNCBUSY_MASK)                            \
      ;                                                                        \
    timer->CTRLBCLR.bit.LUPD = 1;                                              \
  } while (0)

#define pwm_tc_config(timer, channel, presc)                                   \
  do {                                                                         \
    timer->COUNT8.CTRLA.bit.ENABLE = 0;                                        \
    while (timer->COUNT8.STATUS.bit.SYNCBUSY)                                  \
      ;                                                                        \
    timer->COUNT8.CTRLA.bit.MODE = 1;                                          \
    while (timer->COUNT8.STATUS.bit.SYNCBUSY)                                  \
      ;                                                                        \
    timer->COUNT8.CTRLA.bit.PRESCALER = presc;                                 \
    while (timer->COUNT8.STATUS.bit.SYNCBUSY)                                  \
      ;                                                                        \
    timer->COUNT8.CTRLA.bit.WAVEGEN = 2;                                       \
    while (timer->COUNT8.STATUS.bit.SYNCBUSY)                                  \
      ;                                                                        \
    timer->COUNT8.PER.reg = 255;                                               \
    while (timer->COUNT8.STATUS.bit.SYNCBUSY)                                  \
      ;                                                                        \
    timer->COUNT8.CTRLA.bit.ENABLE = 1;                                        \
    while (timer->COUNT8.STATUS.bit.SYNCBUSY)                                  \
      ;                                                                        \
  } while (0)
#define pwm_tc_get(timer, channel) (timer->COUNT8.CC[channel].reg)
#define pwm_tc_set(timer, channel, value)                                      \
  do {                                                                         \
    timer->COUNT8.CC[channel].reg = value;                                     \
  } while (0)

#define _pwm_timer0 TCC0
#define _pwm_timer1 TCC1
#define _pwm_timer2 TCC2
#define _pwm_timer3 TC3
#define _pwm_timer4 TC4
#define _pwm_timer5 TC5
#define _pwm_timer6 TC6
#define _pwm_timer7 TC7
#define _pwm_timer(X) _pwm_timer##X
#define pwm_timer(X) _pwm_timer(X)

#define _pwm_t_config0 pwm_tcc_config
#define _pwm_t_config1 pwm_tcc_config
#define _pwm_t_config2 pwm_tcc_config
#define _pwm_t_config3 pwm_tc_config
#define _pwm_t_config4 pwm_tc_config
#define _pwm_t_config5 pwm_tc_config
#define _pwm_t_config6 pwm_tc_config
#define _pwm_t_config7 pwm_tc_config
#define _pwm_t_config(X, Y, Z) _pwm_t_config##X(pwm_timer(X), Y, Z)
#define pwm_t_config(X, Y, Z) _pwm_t_config(X, Y, Z)

#define _pwm_t_set0 pwm_tcc_set
#define _pwm_t_set1 pwm_tcc_set
#define _pwm_t_set2 pwm_tcc_set
#define _pwm_t_set3 pwm_tc_set
#define _pwm_t_set4 pwm_tc_set
#define _pwm_t_set5 pwm_tc_set
#define _pwm_t_set6 pwm_tc_set
#define _pwm_t_set7 pwm_tc_set
#define _pwm_t_set(X, Y, Z) _pwm_t_set##X(pwm_timer(X), Y, Z)
#define pwm_t_set(X, Y, Z) _pwm_t_set(X, Y, Z)

