Paciente8159/uCNC/uCNC/src/hal/mcus/samd21/mcumap_samd21.h
#define _pwm_t_get0 pwm_tcc_get
#define _pwm_t_get1 pwm_tcc_get
#define _pwm_t_get2 pwm_tcc_get
#define _pwm_t_get3 pwm_tc_get
#define _pwm_t_get4 pwm_tc_get
#define _pwm_t_get5 pwm_tc_get
#define _pwm_t_get6 pwm_tc_get
#define _pwm_t_get7 pwm_tc_get
#define _pwm_t_get(X, Y) _pwm_t_get##X(pwm_timer(X), Y)
#define pwm_t_get(X, Y) _pwm_t_get(X, Y)

#ifdef PWM0
#define PWM0_CLKCTRL gclk_clkctrl(PWM0_TIMER)
#define PWM0_PMUX (pinmux(PWM0_PORT, PWM0_BIT))
#define PWM0_PMUXVAL (pinmuxval(PWM0_MUX))
#define DIO25_TIMER PWM0_TIMER
#define DIO25_CHANNEL PWM0_CHANNEL
#define DIO25_MUX PWM0_MUX
#define DIO25_CLKCTRL PWM0_CLKCTRL
#define DIO25_PMUX PWM0_PMUX
#define DIO25_PMUXVAL PWM0_PMUXVAL
#endif
#ifdef PWM1
#define PWM1_CLKCTRL gclk_clkctrl(PWM1_TIMER)
#define PWM1_PMUX (pinmux(PWM1_PORT, PWM1_BIT))
#define PWM1_PMUXVAL (pinmuxval(PWM1_MUX))
#define DIO26_TIMER PWM1_TIMER
#define DIO26_CHANNEL PWM1_CHANNEL
#define DIO26_MUX PWM1_MUX
#define DIO26_CLKCTRL PWM1_CLKCTRL
#define DIO26_PMUX PWM1_PMUX
#define DIO26_PMUXVAL PWM1_PMUXVAL
#endif
#ifdef PWM2
#define PWM2_CLKCTRL gclk_clkctrl(PWM2_TIMER)
#define PWM2_PMUX (pinmux(PWM2_PORT, PWM2_BIT))
#define PWM2_PMUXVAL (pinmuxval(PWM2_MUX))
#define DIO27_TIMER PWM2_TIMER
#define DIO27_CHANNEL PWM2_CHANNEL
#define DIO27_MUX PWM2_MUX
#define DIO27_CLKCTRL PWM2_CLKCTRL
#define DIO27_PMUX PWM2_PMUX
#define DIO27_PMUXVAL PWM2_PMUXVAL
#endif
#ifdef PWM3
#define PWM3_CLKCTRL gclk_clkctrl(PWM3_TIMER)
#define PWM3_PMUX (pinmux(PWM3_PORT, PWM3_BIT))
#define PWM3_PMUXVAL (pinmuxval(PWM3_MUX))
#define DIO28_TIMER PWM3_TIMER
#define DIO28_CHANNEL PWM3_CHANNEL
#define DIO28_MUX PWM3_MUX
#define DIO28_CLKCTRL PWM3_CLKCTRL
#define DIO28_PMUX PWM3_PMUX
#define DIO28_PMUXVAL PWM3_PMUXVAL
#endif
#ifdef PWM4
#define PWM4_CLKCTRL gclk_clkctrl(PWM4_TIMER)
#define PWM4_PMUX (pinmux(PWM4_PORT, PWM4_BIT))
#define PWM4_PMUXVAL (pinmuxval(PWM4_MUX))
#define DIO29_TIMER PWM4_TIMER
#define DIO29_CHANNEL PWM4_CHANNEL
#define DIO29_MUX PWM4_MUX
#define DIO29_CLKCTRL PWM4_CLKCTRL
#define DIO29_PMUX PWM4_PMUX
#define DIO29_PMUXVAL PWM4_PMUXVAL
#endif
#ifdef PWM5
#define PWM5_CLKCTRL gclk_clkctrl(PWM5_TIMER)
#define PWM5_PMUX (pinmux(PWM5_PORT, PWM5_BIT))
#define PWM5_PMUXVAL (pinmuxval(PWM5_MUX))
#define DIO30_TIMER PWM5_TIMER
#define DIO30_CHANNEL PWM5_CHANNEL
#define DIO30_MUX PWM5_MUX
#define DIO30_CLKCTRL PWM5_CLKCTRL
#define DIO30_PMUX PWM5_PMUX
#define DIO30_PMUXVAL PWM5_PMUXVAL
#endif
#ifdef PWM6
#define PWM6_CLKCTRL gclk_clkctrl(PWM6_TIMER)
#define PWM6_PMUX (pinmux(PWM6_PORT, PWM6_BIT))
#define PWM6_PMUXVAL (pinmuxval(PWM6_MUX))
#define DIO31_TIMER PWM6_TIMER
#define DIO31_CHANNEL PWM6_CHANNEL
#define DIO31_MUX PWM6_MUX
#define DIO31_CLKCTRL PWM6_CLKCTRL
#define DIO31_PMUX PWM6_PMUX
#define DIO31_PMUXVAL PWM6_PMUXVAL
#endif
#ifdef PWM7
#define PWM7_CLKCTRL gclk_clkctrl(PWM7_TIMER)
#define PWM7_PMUX (pinmux(PWM7_PORT, PWM7_BIT))
#define PWM7_PMUXVAL (pinmuxval(PWM7_MUX))
#define DIO32_TIMER PWM7_TIMER
#define DIO32_CHANNEL PWM7_CHANNEL
#define DIO32_MUX PWM7_MUX
#define DIO32_CLKCTRL PWM7_CLKCTRL
#define DIO32_PMUX PWM7_PMUX
#define DIO32_PMUXVAL PWM7_PMUXVAL
#endif
#ifdef PWM8
#define PWM8_CLKCTRL gclk_clkctrl(PWM8_TIMER)
#define PWM8_PMUX (pinmux(PWM8_PORT, PWM8_BIT))
#define PWM8_PMUXVAL (pinmuxval(PWM8_MUX))
#define DIO33_TIMER PWM8_TIMER
#define DIO33_CHANNEL PWM8_CHANNEL
#define DIO33_MUX PWM8_MUX
#define DIO33_CLKCTRL PWM8_CLKCTRL
#define DIO33_PMUX PWM8_PMUX
#define DIO33_PMUXVAL PWM8_PMUXVAL
#endif
#ifdef PWM9
#define PWM9_CLKCTRL gclk_clkctrl(PWM9_TIMER)
#define PWM9_PMUX (pinmux(PWM9_PORT, PWM9_BIT))
#define PWM9_PMUXVAL (pinmuxval(PWM9_MUX))
#define DIO34_TIMER PWM9_TIMER
#define DIO34_CHANNEL PWM9_CHANNEL
#define DIO34_MUX PWM9_MUX
#define DIO34_CLKCTRL PWM9_CLKCTRL
#define DIO34_PMUX PWM9_PMUX
#define DIO34_PMUXVAL PWM9_PMUXVAL
#endif
#ifdef PWM10
#define PWM10_CLKCTRL gclk_clkctrl(PWM10_TIMER)
#define PWM10_PMUX (pinmux(PWM10_PORT, PWM10_BIT))
#define PWM10_PMUXVAL (pinmuxval(PWM10_MUX))
#define DIO35_TIMER PWM10_TIMER
#define DIO35_CHANNEL PWM10_CHANNEL
#define DIO35_MUX PWM10_MUX
#define DIO35_CLKCTRL PWM10_CLKCTRL
#define DIO35_PMUX PWM10_PMUX
#define DIO35_PMUXVAL PWM10_PMUXVAL
#endif
#ifdef PWM11
#define PWM11_CLKCTRL gclk_clkctrl(PWM11_TIMER)
#define PWM11_PMUX (pinmux(PWM11_PORT, PWM11_BIT))
#define PWM11_PMUXVAL (pinmuxval(PWM11_MUX))
#define DIO36_TIMER PWM11_TIMER
#define DIO36_CHANNEL PWM11_CHANNEL
#define DIO36_MUX PWM11_MUX
#define DIO36_CLKCTRL PWM11_CLKCTRL
#define DIO36_PMUX PWM11_PMUX
#define DIO36_PMUXVAL PWM11_PMUXVAL
#endif
#ifdef PWM12
#define PWM12_CLKCTRL gclk_clkctrl(PWM12_TIMER)
#define PWM12_PMUX (pinmux(PWM12_PORT, PWM12_BIT))
#define PWM12_PMUXVAL (pinmuxval(PWM12_MUX))
#define DIO37_TIMER PWM12_TIMER
#define DIO37_CHANNEL PWM12_CHANNEL
#define DIO37_MUX PWM12_MUX
#define DIO37_CLKCTRL PWM12_CLKCTRL
#define DIO37_PMUX PWM12_PMUX
#define DIO37_PMUXVAL PWM12_PMUXVAL
#endif
#ifdef PWM13
#define PWM13_CLKCTRL gclk_clkctrl(PWM13_TIMER)
#define PWM13_PMUX (pinmux(PWM13_PORT, PWM13_BIT))
#define PWM13_PMUXVAL (pinmuxval(PWM13_MUX))
#define DIO38_TIMER PWM13_TIMER
#define DIO38_CHANNEL PWM13_CHANNEL
#define DIO38_MUX PWM13_MUX
#define DIO38_CLKCTRL PWM13_CLKCTRL
#define DIO38_PMUX PWM13_PMUX
#define DIO38_PMUXVAL PWM13_PMUXVAL
#endif
#ifdef PWM14
#define PWM14_CLKCTRL gclk_clkctrl(PWM14_TIMER)
#define PWM14_PMUX (pinmux(PWM14_PORT, PWM14_BIT))
#define PWM14_PMUXVAL (pinmuxval(PWM14_MUX))
#define DIO39_TIMER PWM14_TIMER
#define DIO39_CHANNEL PWM14_CHANNEL
#define DIO39_MUX PWM14_MUX
#define DIO39_CLKCTRL PWM14_CLKCTRL
#define DIO39_PMUX PWM14_PMUX
#define DIO39_PMUXVAL PWM14_PMUXVAL
#endif
#ifdef PWM15
#define PWM15_CLKCTRL gclk_clkctrl(PWM15_TIMER)
#define PWM15_PMUX (pinmux(PWM15_PORT, PWM15_BIT))
#define PWM15_PMUXVAL (pinmuxval(PWM15_MUX))
#define DIO40_TIMER PWM15_TIMER
#define DIO40_CHANNEL PWM15_CHANNEL
#define DIO40_MUX PWM15_MUX
#define DIO40_CLKCTRL PWM15_CLKCTRL
#define DIO40_PMUX PWM15_PMUX
#define DIO40_PMUXVAL PWM15_PMUXVAL
#endif

/*Analog*/
#ifdef ANALOG0
#ifdef ANALOG0_CHANNEL
#define ANALOG0_PMUXVAL 1
#define ANALOG0_PMUX (pinmux(ANALOG0_PORT, ANALOG0_BIT))
#else
#error "ANALOG0_CHANNEL not defined"
#endif
#define DIO114_CHANNEL ANALOG0_CHANNEL
#define DIO114_PMUXVAL ANALOG0_PMUXVAL
#define DIO114_PMUX ANALOG0_PMUX
#endif
#ifdef ANALOG1
#ifdef ANALOG1_CHANNEL
#define ANALOG1_PMUXVAL 1
#define ANALOG1_PMUX (pinmux(ANALOG1_PORT, ANALOG1_BIT))
#else
#error "ANALOG1_CHANNEL not defined"
#endif
#define DIO115_CHANNEL ANALOG1_CHANNEL
#define DIO115_PMUXVAL ANALOG1_PMUXVAL
#define DIO115_PMUX ANALOG1_PMUX
#endif
#ifdef ANALOG2
#ifdef ANALOG2_CHANNEL
#define ANALOG2_PMUXVAL 1
#define ANALOG2_PMUX (pinmux(ANALOG2_PORT, ANALOG2_BIT))
#else
#error "ANALOG2_CHANNEL not defined"
#endif
#define DIO116_CHANNEL ANALOG2_CHANNEL
#define DIO116_PMUXVAL ANALOG2_PMUXVAL
#define DIO116_PMUX ANALOG2_PMUX
#endif
#ifdef ANALOG3
#ifdef ANALOG3_CHANNEL
#define ANALOG3_PMUXVAL 1
#define ANALOG3_PMUX (pinmux(ANALOG3_PORT, ANALOG3_BIT))
#else
#error "ANALOG3_CHANNEL not defined"
#endif
#define DIO117_CHANNEL ANALOG3_CHANNEL
#define DIO117_PMUXVAL ANALOG3_PMUXVAL
#define DIO117_PMUX ANALOG3_PMUX
#endif
#ifdef ANALOG4
#ifdef ANALOG4_CHANNEL
#define ANALOG4_PMUXVAL 1
#define ANALOG4_PMUX (pinmux(ANALOG4_PORT, ANALOG4_BIT))
#else
#error "ANALOG4_CHANNEL not defined"
#endif
#define DIO118_CHANNEL ANALOG4_CHANNEL
#define DIO118_PMUXVAL ANALOG4_PMUXVAL
#define DIO118_PMUX ANALOG4_PMUX
#endif
#ifdef ANALOG5
#ifdef ANALOG5_CHANNEL
#define ANALOG5_PMUXVAL 1
#define ANALOG5_PMUX (pinmux(ANALOG5_PORT, ANALOG5_BIT))
#else
#error "ANALOG5_CHANNEL not defined"
#endif
#define DIO119_CHANNEL ANALOG5_CHANNEL
#define DIO119_PMUXVAL ANALOG5_PMUXVAL
#define DIO119_PMUX ANALOG5_PMUX
#endif
#ifdef ANALOG6
#ifdef ANALOG6_CHANNEL
#define ANALOG6_PMUXVAL 1
#define ANALOG6_PMUX (pinmux(ANALOG6_PORT, ANALOG6_BIT))
#else
#error "ANALOG6_CHANNEL not defined"
#endif
#define DIO120_CHANNEL ANALOG6_CHANNEL
#define DIO120_PMUXVAL ANALOG6_PMUXVAL
#define DIO120_PMUX ANALOG6_PMUX
#endif
#ifdef ANALOG7
#ifdef ANALOG7_CHANNEL
#define ANALOG7_PMUXVAL 1
#define ANALOG7_PMUX (pinmux(ANALOG7_PORT, ANALOG7_BIT))
#else
#error "ANALOG7_CHANNEL not defined"
#endif
#define DIO121_CHANNEL ANALOG7_CHANNEL
#define DIO121_PMUXVAL ANALOG7_PMUXVAL
#define DIO121_PMUX ANALOG7_PMUX
#endif
#ifdef ANALOG8
#ifdef ANALOG8_CHANNEL
#define ANALOG8_PMUXVAL 1
#define ANALOG8_PMUX (pinmux(ANALOG8_PORT, ANALOG8_BIT))
#else
#error "ANALOG8_CHANNEL not defined"
#endif
#define DIO122_CHANNEL ANALOG8_CHANNEL
#define DIO122_PMUXVAL ANALOG8_PMUXVAL
#define DIO122_PMUX ANALOG8_PMUX
#endif
#ifdef ANALOG9
#ifdef ANALOG9_CHANNEL
#define ANALOG9_PMUXVAL 1
#define ANALOG9_PMUX (pinmux(ANALOG9_PORT, ANALOG9_BIT))
#else
#error "ANALOG9_CHANNEL not defined"
#endif
#define DIO123_CHANNEL ANALOG9_CHANNEL
#define DIO123_PMUXVAL ANALOG9_PMUXVAL
#define DIO123_PMUX ANALOG9_PMUX
#endif
#ifdef ANALOG10
#ifdef ANALOG10_CHANNEL
#define ANALOG10_PMUXVAL 1
#define ANALOG10_PMUX (pinmux(ANALOG10_PORT, ANALOG10_BIT))
#else
#error "ANALOG10_CHANNEL not defined"
#endif
#define DIO124_CHANNEL ANALOG10_CHANNEL
#define DIO124_PMUXVAL ANALOG10_PMUXVAL
#define DIO124_PMUX ANALOG10_PMUX
#endif
#ifdef ANALOG11
#ifdef ANALOG11_CHANNEL
#define ANALOG11_PMUXVAL 1
#define ANALOG11_PMUX (pinmux(ANALOG11_PORT, ANALOG11_BIT))
#else
#error "ANALOG11_CHANNEL not defined"
#endif
#define DIO125_CHANNEL ANALOG11_CHANNEL
#define DIO125_PMUXVAL ANALOG11_PMUXVAL
#define DIO125_PMUX ANALOG11_PMUX
#endif
#ifdef ANALOG12
#ifdef ANALOG12_CHANNEL
#define ANALOG12_PMUXVAL 1
#define ANALOG12_PMUX (pinmux(ANALOG12_PORT, ANALOG12_BIT))
#else
#error "ANALOG12_CHANNEL not defined"
#endif
#define DIO126_CHANNEL ANALOG12_CHANNEL
#define DIO126_PMUXVAL ANALOG12_PMUXVAL
#define DIO126_PMUX ANALOG12_PMUX
#endif
#ifdef ANALOG13
#ifdef ANALOG13_CHANNEL
#define ANALOG13_PMUXVAL 1
#define ANALOG13_PMUX (pinmux(ANALOG13_PORT, ANALOG13_BIT))
#else
#error "ANALOG13_CHANNEL not defined"
#endif
#define DIO127_CHANNEL ANALOG13_CHANNEL
#define DIO127_PMUXVAL ANALOG13_PMUXVAL
#define DIO127_PMUX ANALOG13_PMUX
#endif
#ifdef ANALOG14
#ifdef ANALOG14_CHANNEL
#define ANALOG14_PMUXVAL 1
#define ANALOG14_PMUX (pinmux(ANALOG14_PORT, ANALOG14_BIT))
#else
#error "ANALOG14_CHANNEL not defined"
#endif
#define DIO128_CHANNEL ANALOG14_CHANNEL
#define DIO128_PMUXVAL ANALOG14_PMUXVAL
#define DIO128_PMUX ANALOG14_PMUX
#endif
#ifdef ANALOG15
#ifdef ANALOG15_CHANNEL
#define ANALOG15_PMUXVAL 1
#define ANALOG15_PMUX (pinmux(ANALOG15_PORT, ANALOG15_BIT))
#else
#error "ANALOG15_CHANNEL not defined"
#endif
#define DIO129_CHANNEL ANALOG15_CHANNEL
#define DIO129_PMUXVAL ANALOG15_PMUXVAL
#define DIO129_PMUX ANALOG15_PMUX
#endif

