Paciente8159/uCNC/uCNC/src/hal/mcus/samd21/mcumap_samd21.h
/*µCNC Pulse ISR*/
#ifndef ITP_TIMER
#define ITP_TIMER 5
#endif
#if (ITP_TIMER < 3)
#define MCU_ITP_ISR __helper__(TCC, ITP_TIMER, _Handler)
#define ITP_REG __helper__(TCC, ITP_TIMER, )
#define ITP_IRQ __helper__(TCC, ITP_TIMER, _IRQn)
#else
#define MCU_ITP_ISR __helper__(TC, ITP_TIMER, _Handler)
#define ITP_REG __helper__(TC, ITP_TIMER, )
#define ITP_IRQ __helper__(TC, ITP_TIMER, _IRQn)
#endif

#ifndef SERVO_TIMER
#define SERVO_TIMER 4
#endif
#if (SERVO_TIMER < 3)
#define MCU_SERVO_ISR __helper__(TCC, SERVO_TIMER, _Handler)
#define SERVO_REG __helper__(TCC, SERVO_TIMER, )
#define SERVO_IRQ __helper__(TCC, SERVO_TIMER, _IRQn)
#else
#define MCU_SERVO_ISR __helper__(TC, SERVO_TIMER, _Handler)
#define SERVO_REG __helper__(TC, SERVO_TIMER, )
#define SERVO_IRQ __helper__(TC, SERVO_TIMER, _IRQn)
#endif

#ifdef ONESHOT_TIMER
#define MCU_HAS_ONESHOT_TIMER
#if (ONESHOT_TIMER < 3)
#define MCU_ONESHOT_ISR __helper__(TCC, ONESHOT_TIMER, _Handler)
#define ONESHOT_REG __helper__(TCC, ONESHOT_TIMER, )
#define ONESHOT_IRQ __helper__(TCC, ONESHOT_TIMER, _IRQn)
#else
#define MCU_ONESHOT_ISR __helper__(TC, ONESHOT_TIMER, _Handler)
#define ONESHOT_REG __helper__(TC, ONESHOT_TIMER, )
#define ONESHOT_IRQ __helper__(TC, ONESHOT_TIMER, _IRQn)
#endif
#endif

#ifndef __indirect__
#define __indirect__ex__(X, Y) DIO##X##_##Y
#define __indirect__(X, Y) __indirect__ex__(X, Y)
#endif

#ifndef BYTE_OPS
#define BYTE_OPS
// Set bit y in byte x
#define SETBIT(x, y) ((x) |= (1 << (y)))
// Clear bit y in byte x
#define CLEARBIT(x, y) ((x) &= ~(1 << (y)))
// Check bit y in byte x
#define CHECKBIT(x, y) ((x) & (1 << (y)))
// Toggle bit y in byte x
#define TOGGLEBIT(x, y) ((x) ^= (1 << (y)))
// Set byte y in byte x
#define SETFLAG(x, y) ((x) |= (y))
// Clear byte y in byte x
#define CLEARFLAG(x, y) ((x) &= ~(y))
// Check byte y in byte x
#define CHECKFLAG(x, y) ((x) & (y))
// Toggle byte y in byte x
#define TOGGLEFLAG(x, y) ((x) ^= (y))
#endif

#define mcu_config_output(diopin)                                              \
  {                                                                            \
    SETBIT(__indirect__(diopin, GPIO).DIR.reg, __indirect__(diopin, BIT));     \
    __indirect__(diopin, GPIO).PINCFG[__indirect__(diopin, BIT)].reg = 2;      \
  }
#define mcu_config_input(diopin)                                               \
  {                                                                            \
    CLEARBIT(__indirect__(diopin, GPIO).DIR.reg, __indirect__(diopin, BIT));   \
    __indirect__(diopin, GPIO).PINCFG[__indirect__(diopin, BIT)].reg = 2;      \
  }
#define mcu_config_pullup(diopin)                                              \
  {                                                                            \
    SETBIT(__indirect__(diopin, GPIO).PINCFG[__indirect__(diopin, BIT)].reg,   \
           2);                                                                 \
    SETBIT(__indirect__(diopin, GPIO).OUT.reg, __indirect__(diopin, BIT));     \
  }
#define mcu_config_altfunc(diopin)                                             \
  {                                                                            \
    SETBIT(__indirect__(diopin, GPIO).PINCFG[__indirect__(diopin, BIT)].reg,   \
           0);                                                                 \
    (__indirect__(diopin, PMUX)) = __indirect__(diopin, PMUXVAL);              \
  }

#define mcu_config_input_isr(diopin) (mcu_config_altfunc(diopin))

#define mcu_config_pwm(diopin, freq)                                           \
  {                                                                            \
    SETBIT(__indirect__(diopin, GPIO).DIR.reg, __indirect__(diopin, BIT));     \
    (__indirect__(diopin, PMUX)) = __indirect__(diopin, PMUXVAL);              \
    __indirect__(diopin, GPIO).PINCFG[__indirect__(diopin, BIT)].reg = 1;      \
    uint16_t div = ((F_TIMERS >> 8) / freq);                                   \
    uint8_t presc = 0;                                                         \
    while (div > 1) {                                                          \
      uint8_t shift = (presc >= 4) ? 2 : 1;                                    \
      div = ((div + 1) >> shift);                                              \
      presc++;                                                                 \
      if (presc == 7) {                                                        \
        break;                                                                 \
      }                                                                        \
    }                                                                          \
    pwm_t_config(__indirect__(diopin, TIMER), __indirect__(diopin, CHANNEL),   \
                 presc);                                                       \
  }

#define mcu_get_input(diopin)                                                  \
  (CHECKBIT(__indirect__(diopin, GPIO).IN.reg, __indirect__(diopin, BIT)))
#define mcu_get_output(diopin)                                                 \
  (CHECKBIT(__indirect__(diopin, GPIO).OUT.reg, __indirect__(diopin, BIT)))
#define mcu_set_output(diopin)                                                 \
  (__indirect__(diopin, GPIO).OUTSET.reg = (1UL << __indirect__(diopin, BIT)))
#define mcu_clear_output(diopin)                                               \
  (__indirect__(diopin, GPIO).OUTCLR.reg = (1UL << __indirect__(diopin, BIT)))
#define mcu_toggle_output(diopin)                                              \
  (__indirect__(diopin, GPIO).OUTTGL.reg = (1UL << __indirect__(diopin, BIT)))

#define mcu_set_pwm(diopin, pwmvalue)                                          \
  pwm_t_set(__indirect__(diopin, TIMER), __indirect__(diopin, CHANNEL),        \
            pwmvalue)
#define mcu_get_pwm(diopin)                                                    \
  (uint8_t)(0xFF & pwm_t_get(__indirect__(diopin, TIMER),                      \
                             __indirect__(diopin, CHANNEL)))

