Paciente8159/uCNC/uCNC/src/hal/mcus/samd21/mcumap_samd21.h
#define mcu_get_analog(diopin)                                                 \
  {                                                                            \
    while (ADC->STATUS.bit.SYNCBUSY)                                           \
      ADC->INTFLAG.reg = ADC_INTFLAG_RESRDY;                                   \
    ;                                                                          \
    while (ADC->STATUS.bit.SYNCBUSY)                                           \
      ;                                                                        \
    ADC->INPUTCTRL.bit.MUXPOS = (__indirect__(diopin, CHANNEL));               \
    while (ADC->STATUS.bit.SYNCBUSY)                                           \
      ;                                                                        \
    ADC->SWTRIG.bit.START = 1;                                                 \
    while (!(ADC->INTFLAG.bit.RESRDY))                                         \
      ;                                                                        \
    ADC->RESULT.reg;                                                           \
  }

#define mcu_config_analog(diopin)                                              \
  {                                                                            \
    CLEARBIT(__indirect__(diopin, GPIO).DIR.reg, __indirect__(diopin, BIT));   \
    __indirect__(diopin, GPIO).PINCFG[__indirect__(diopin, BIT)].reg = 0;      \
    SETBIT(__indirect__(diopin, GPIO).PINCFG[__indirect__(diopin, BIT)].reg,   \
           0);                                                                 \
    (__indirect__(diopin, PMUX)) = __indirect__(diopin, PMUXVAL);              \
    mcu_get_analog(diopin);                                                    \
  }
/*
#define mcu_get_pwm(diopin) ((uint8_t)((((uint32_t)__indirect__(diopin,
TIMREG)->__indirect__(diopin, CCR)) * 255) / ((uint32_t)__indirect__(diopin,
TIMREG)->ARR))) #ifdef PROBE #ifdef PROBE_ISR #define mcu_enable_probe_isr()
SETBIT(EXTI->IMR, PROBE_BIT) #define mcu_disable_probe_isr() CLEARBIT(EXTI->IMR,
PROBE_BIT) #else #define mcu_enable_probe_isr() #define mcu_disable_probe_isr()
#endif
#endif
*/
#define mcu_enable_global_isr __enable_irq
#define mcu_disable_global_isr __disable_irq
#define mcu_get_global_isr() (__get_PRIMASK() == 0u)
#define mcu_in_isr_context() (__get_IPSR() != 0)
#define mcu_free_micros()                                                      \
  ((uint32_t)((((SysTick->LOAD + 1) - SysTick->VAL) * 1000UL) /                \
              (SysTick->LOAD + 1)))

#ifdef __cplusplus
}
#endif

#endif
